Repository: reekeer/tg-ws-proxy-ios
Catalog: ios/TgWsProxy/Localizable.xcstrings
Source language: ru
Languages: en

source: /с
en: /s

source: %lld строк
en: %lld lines

source: Rust-ядро (Android-форк)
en: Rust core (Android fork)

source: Rust-ядро не запустилось
en: Rust core failed to start

source: Rust-ядро синхронизируется с upstream.
en: The Rust core is synchronized with upstream.

source: Rust-ядро синхронизируется с upstream. Лицензия GPLv3 (ядро) / MIT (оригинал).
en: The Rust core is synchronized with upstream. GPLv3 for the core / MIT for the original project.

source: VPN-туннель
en: VPN tunnel

source: Авто-переподключение
en: Auto-reconnect

source: Авто-старт при запуске
en: Auto-start on launch

source: Адрес
en: Address

source: Адрес:
en: Address:

source: Активные
en: Active

source: Акцент
en: Accent

source: В сети
en: Online

source: Вибрация
en: Haptics

source: Внешний вид
en: Appearance

source: Всегда свежее ядро
en: Always-current core

source: Главная
en: Home

source: Графит
en: Graphite

source: Диагностика
en: Diagnostics

source: Задержка TCP-подключения напрямую (без прокси).
en: Direct TCP connection latency (without the proxy).

source: Задержка до DC
en: DC latency

source: Закрыть
en: Close

source: Запуск…
en: Starting…

source: Запусти прокси и открой его в Telegram одной кнопкой.
en: Start the proxy and open it in Telegram with one button.

source: Запустите прокси, чтобы увидеть вывод Rust-ядра.
en: Start the proxy to see Rust core output.

source: Зелёный
en: Green

source: Индиго
en: Indigo

source: Информация
en: About

source: Использовать Cloudflare
en: Use Cloudflare

source: Как в системе
en: System

source: Копировать всё
en: Copy all

source: Логи
en: Logs

source: Логи пусты
en: No logs

source: Логи ядра
en: Core logs

source: Локальный MTProto
en: Local MTProto

source: Локальный MTProto-прокси для Telegram на Rust-ядре
en: Local MTProto proxy for Telegram powered by Rust

source: Локальный MTProto-прокси для Telegram на быстром Rust-ядре
en: A local Telegram MTProto proxy powered by a fast Rust core

source: Локальный прокси
en: Local proxy

source: Локальный режим
en: Local mode

source: Мой репозиторий
en: My repository

source: На iOS 26 и новее использует системное стекло. При отключении остаётся лёгкий материал.
en: Uses system Liquid Glass on iOS 26 and newer. When disabled, a light material is used instead.

source: Настройки
en: Settings

source: Настройки прокси заблокированы, пока прокси запущен.
en: Proxy settings are locked while the proxy is running.

source: Начать
en: Get started

source: Не подключено
en: Not connected

source: недоступен
en: unavailable

source: Нет доступа к кэшу приложения.
en: The app cache is unavailable.

source: Один тап
en: One tap

source: Оранжевый
en: Orange

source: Оригинальный проект
en: Original project

source: Отключено
en: Disconnected

source: Открыть в Telegram
en: Open in Telegram

source: Открыть логи отдельно
en: Open logs separately

source: Отправлено
en: Uploaded

source: Отчёты об ошибках
en: Error reports

source: Очистить
en: Clear

source: Ошибка запуска
en: Startup error

source: Ошибки
en: Errors

source: Переопределения адресов
en: Address overrides

source: Поведение
en: Behavior

source: Поделиться
en: Share

source: Подключено
en: Connected

source: Поднимаем Rust-ядро и WebSocket-пул
en: Starting the Rust core and WebSocket pool

source: Подробные логи Rust
en: Verbose Rust logs

source: Получено
en: Downloaded

source: Порт
en: Port

source: Порт занят. Закройте другой прокси или смените порт в настройках.
en: The port is in use. Close the other proxy or choose another port in Settings.

source: Порт:
en: Port:

source: Приватность
en: Privacy

source: Приложение адаптировано под мобильные сети, но проблемы с фоновой работой возможны из-за ограничений системы или сети. Если возникла проблема — нажмите «Собрать отчёт» и приложите данные к issue. Мелкие ошибки в логах при работающем прокси можно игнорировать.
en: The app is adapted for mobile networks, but background issues are still possible due to system or network limits. If you hit a problem, tap “Collect report” and attach the data to your issue. Minor log errors while the proxy works fine can be ignored.

source: Проверить задержку до DC
en: Test DC latency

source: Прокси запущен
en: Proxy started

source: Прокси остановлен
en: Proxy stopped

source: Прокси работает
en: Proxy is running

source: Прокси уже запущен.
en: The proxy is already running.

source: Пул
en: Pool

source: Пустое значение использует адреса из Rust upstream.
en: Leave empty to use addresses from the Rust upstream.

source: Размер пула
en: Pool size

source: Размер пула:
en: Pool size:

source: Режим
en: Mode

source: Розовый
en: Pink

source: Русский
en: Russian

source: Сбор данных…
en: Collecting data…

source: Светлая
en: Light

source: Свой домен (необязательно)
en: Custom domain (optional)

source: Сгенерировать новый
en: Generate new

source: Секрет
en: Secret

source: Системная
en: System

source: Системный VPN-туннель удерживает прокси активным в фоне.
en: The system VPN tunnel keeps the proxy active in the background.

source: Скорость
en: Speed

source: Собрать отчёт
en: Collect report

source: Соединения
en: Connections

source: Состояние
en: Status

source: Строк:
en: Lines:

source: Тема
en: Theme

source: Тёмная
en: Dark

source: Трафик идёт через WSS/Cloudflare к дата-центрам Telegram.
en: Traffic goes through WSS/Cloudflare to Telegram data centers.

source: Уведомления
en: Notifications

source: Язык
en: Language

source: Язык приложения
en: App language

source: Локальный прокси работает, пока приложение открыто. Включите удержание фона в настройках или используйте сборку с VPN-туннелем.
en: The local proxy runs while the app is open. Enable background hold in settings or use a build with the VPN tunnel.

source: Локальный режим не переживает сворачивание приложения. Приложение подписывается на обновления геопозиции, чтобы iOS не приостанавливала процесс. Нужен доступ к геопозиции в режиме «Всегда».
en: Local mode does not survive backgrounding. The app subscribes to location updates so iOS does not suspend the process. Location access must be set to “Always”.

source: Открыть настройки геопозиции
en: Open location settings

source: Прокси удерживается в фоне через геопозицию.
en: Location updates keep the proxy alive in the background.

source: Удерживать прокси в фоне
en: Keep the proxy alive in the background

source: Чтобы прокси не засыпал, разрешите доступ к геопозиции в режиме «Всегда» в настройках iOS.
en: Set location access to “Always” in iOS settings so the proxy does not go to sleep.
